wisteria-1c/Конфигурация/InformationRegisters/ПравилаМаршрутизацииЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПравилаМаршрутизацииЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыСогласованияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПоказателейЗаявкиНаРасходДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСравнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидСравненияЗначений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеДляСравнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходДСПлан</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВидыПоказателейЗаявкиНаРасходДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыПоказателейЗаявкиНаРасходДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Статья</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВидСравненияЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидСравненияЗначений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Больше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БольшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Меньше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеньшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Равно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСписке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИнтервале</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИнтервалеВключая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИнтервалеВключаяЛево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИнтервалеВключаяПраво</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ПравилаМаршрутизацииЗаявок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подобрать маршрут по показателям заявки
// 
// Параметры:
//  ДанныеЗаявки - Структура - данные заявки
// 
// Возвращаемое значение:
//  СправочникСсылка.МаршрутыСогласованияЗаявок, Неопределено - подобранный маршрут
//
Функция ПодобратьМаршрут(ДанныеЗаявки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПравилаМаршрутизацииЗаявок.ВидПоказателя КАК ВидПоказателя,
		|	ПравилаМаршрутизацииЗаявок.ВидСравнения КАК ВидСравнения,
		|	ПравилаМаршрутизацииЗаявок.ЗначениеДляСравнения КАК ЗначениеДляСравнения,
		|	ПравилаМаршрутизацииЗаявок.Маршрут КАК Маршрут
		|ИЗ
		|	РегистрСведений.ПравилаМаршрутизацииЗаявок КАК ПравилаМаршрутизацииЗаявок
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПравилаМаршрутизацииЗаявок.Маршрут.Приоритет УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВидПоказателя = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.ВидОперации Тогда
			Результат = ПолучитьРезультатСравнения(ДанныеЗаявки.ВидОперации, Выборка.ВидСравнения, Выборка.ЗначениеДляСравнения);	
		ИначеЕсли Выборка.ВидПоказателя = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.Автор Тогда
			Результат = ПолучитьРезультатСравнения(ДанныеЗаявки.Автор, Выборка.ВидСравнения, Выборка.ЗначениеДляСравнения);
		ИначеЕсли Выборка.ВидПоказателя = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.Статья Тогда
			Результат = ПолучитьРезультатСравнения(ДанныеЗаявки.Статья, Выборка.ВидСравнения, Выборка.ЗначениеДляСравнения);
		ИначеЕсли Выборка.ВидПоказателя = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.Сумма Тогда
			Результат = ПолучитьРезультатСравнения(ДанныеЗаявки.Сумма, Выборка.ВидСравнения, Выборка.ЗначениеДляСравнения);
		КонецЕсли;
		
		Если Результат = Истина Тогда
			Возврат Выборка.Маршрут;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить результат сравнения.
// 
// Параметры:
//  ЛевоеЗначение - Произвольный - Левое значение
//  ВидСравнения - Произвольный - Вид сравнения
//  ПравоеЗначение - Произвольный - Правое значение
// 
// Возвращаемое значение:
//  Булево - Результат сравнения
//
Функция ПолучитьРезультатСравнения(ЛевоеЗначение, ВидСравнения, ПравоеЗначение)
	
	Результат = Ложь;
	
	Если ВидСравнения = Перечисления.ВидСравненияЗначений.Больше Тогда
		Результат = (ЛевоеЗначение > ПравоеЗначение);
	ИначеЕсли ВидСравнения = Перечисления.ВидСравненияЗначений.БольшеИлиРавно Тогда
		Результат = (ЛевоеЗначение >= ПравоеЗначение);
	ИначеЕсли ВидСравнения = Перечисления.ВидСравненияЗначений.Меньше Тогда
		Результат = (ЛевоеЗначение < ПравоеЗначение);
	ИначеЕсли ВидСравнения = Перечисления.ВидСравненияЗначений.МеньшеИлиРавно Тогда
		Результат = (ЛевоеЗначение <= ПравоеЗначение);
	ИначеЕсли ВидСравнения = Перечисления.ВидСравненияЗначений.Равно Тогда
		Результат = (ЛевоеЗначение = ПравоеЗначение);
	Иначе // Не равно
		Результат = (ЛевоеЗначение <> ПравоеЗначение);
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#КонецЕсли
